Revit 2027 API
RebarConstrainedHandle.IsValid Method
 Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid, false otherwise.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace